yeashen/raspberry-stm32/stm32/src/mpu6050.h
#define MPU6050_PWR1_DEVICE_RESET_BIT   7
#define MPU6050_PWR1_SLEEP_BIT          6
#define MPU6050_PWR1_CYCLE_BIT          5
#define MPU6050_PWR1_TEMP_DIS_BIT       3
#define MPU6050_PWR1_CLKSEL_BIT         2
#define MPU6050_PWR1_CLKSEL_LENGTH      3

#define MPU6050_CLOCK_INTERNAL          0x00
#define MPU6050_CLOCK_PLL_XGYRO         0x01
#define MPU6050_CLOCK_PLL_YGYRO         0x02
#define MPU6050_CLOCK_PLL_ZGYRO         0x03
#define MPU6050_CLOCK_PLL_EXT32K        0x04
#define MPU6050_CLOCK_PLL_EXT19M        0x05
#define MPU6050_CLOCK_KEEP_RESET        0x07

#define MPU6050_PWR2_LP_WAKE_CTRL_BIT       7
#define MPU6050_PWR2_LP_WAKE_CTRL_LENGTH    2
#define MPU6050_PWR2_STBY_XA_BIT            5
#define MPU6050_PWR2_STBY_YA_BIT            4
#define MPU6050_PWR2_STBY_ZA_BIT            3
#define MPU6050_PWR2_STBY_XG_BIT            2
#define MPU6050_PWR2_STBY_YG_BIT            1
#define MPU6050_PWR2_STBY_ZG_BIT            0

#define MPU6050_WAKE_FREQ_1P25      0x0
#define MPU6050_WAKE_FREQ_2P5       0x1
#define MPU6050_WAKE_FREQ_5         0x2
#define MPU6050_WAKE_FREQ_10        0x3

#define MPU6050_BANKSEL_PRFTCH_EN_BIT       6
#define MPU6050_BANKSEL_CFG_USER_BANK_BIT   5
#define MPU6050_BANKSEL_MEM_SEL_BIT         4
#define MPU6050_BANKSEL_MEM_SEL_LENGTH      5

#define MPU6050_WHO_AM_I_BIT        6
#define MPU6050_WHO_AM_I_LENGTH     6

#define MPU6050_DMP_MEMORY_BANKS        8
#define MPU6050_DMP_MEMORY_BANK_SIZE    256
#define MPU6050_DMP_MEMORY_CHUNK_SIZE   16	 

#define MPU6050_DEG_PER_LSB_250  (float)((2 * 250.0) / 65536.0)
#define MPU6050_DEG_PER_LSB_500  (float)((2 * 500.0) / 65536.0)
#define MPU6050_DEG_PER_LSB_1000 (float)((2 * 1000.0) / 65536.0)
#define MPU6050_DEG_PER_LSB_2000 (float)((2 * 2000.0) / 65536.0)

#define MPU6050_DEG_PER_LSB		MPU6050_DEG_PER_LSB_500

#define MPU6050_G_PER_LSB_2      (float)((2 * 2) / 65536.0)
#define MPU6050_G_PER_LSB_4      (float)((2 * 4) / 65536.0)
#define MPU6050_G_PER_LSB_8      (float)((2 * 8) / 65536.0)
#define MPU6050_G_PER_LSB_16     (float)((2 * 16) / 65536.0)

#define MPU6050_G_PER_LSB		MPU6050_G_PER_LSB_2

#define MPU6050_ST_GYRO_LOW      10.0   // deg/s
#define MPU6050_ST_GYRO_HIGH     105.0  // deg/s
#define MPU6050_ST_ACCEL_LOW     0.300  // G
#define MPU6050_ST_ACCEL_HIGH    0.950  // G

#define MPU6050_TEMP_PER_LSB		340

void mpu6050_init(void);
//bool mpu6050_testConnection();

//// AUX_VDDIO register
//uint8_t mpu6050_getAuxVDDIOLevel();
//void mpu6050_setAuxVDDIOLevel(uint8_t level);

//// SMPLRT_DIV register
uint8_t mpu6050_getRate(void);
void mpu6050_setRate(uint8_t rate);

//// CONFIG register
//uint8_t mpu6050_getExternalFrameSync();
//void mpu6050_setExternalFrameSync(uint8_t sync);
uint8_t mpu6050_getDLPFMode(void);
void mpu6050_setDLPFMode(uint8_t bandwidth);

//// GYRO_CONFIG register
uint8_t mpu6050_getFullScaleGyroRange(void);
void mpu6050_setFullScaleGyroRange(uint8_t range);

//// ACCEL_CONFIG register
//bool mpu6050_getAccelXSelfTest();
//void mpu6050_setAccelXSelfTest(bool enabled);
//bool mpu6050_getAccelYSelfTest();
//void mpu6050_setAccelYSelfTest(bool enabled);
//bool mpu6050_getAccelZSelfTest();
//void mpu6050_setAccelZSelfTest(bool enabled);
//uint8_t mpu6050_getFullScaleAccelRange();
void mpu6050_setFullScaleAccelRange(uint8_t range);
//uint8_t mpu6050_getDHPFMode();
//void mpu6050_setDHPFMode(uint8_t mode);

//// FF_THR register
//uint8_t mpu6050_getFreefallDetectionThreshold();
//void mpu6050_setFreefallDetectionThreshold(uint8_t threshold);

//// FF_DUR register
//uint8_t mpu6050_getFreefallDetectionDuration();
//void mpu6050_setFreefallDetectionDuration(uint8_t duration);

//// MOT_THR register
//uint8_t mpu6050_getMotionDetectionThreshold();
//void mpu6050_setMotionDetectionThreshold(uint8_t threshold);

//// MOT_DUR register
//uint8_t mpu6050_getMotionDetectionDuration();
//void mpu6050_setMotionDetectionDuration(uint8_t duration);

//// ZRMOT_THR register
//uint8_t mpu6050_getZeroMotionDetectionThreshold();
//void mpu6050_setZeroMotionDetectionThreshold(uint8_t threshold);

//// ZRMOT_DUR register
//uint8_t mpu6050_getZeroMotionDetectionDuration();
//void mpu6050_setZeroMotionDetectionDuration(uint8_t duration);

//// FIFO_EN register
//bool mpu6050_getTempFIFOEnabled();
//void mpu6050_setTempFIFOEnabled(bool enabled);
//bool mpu6050_getXGyroFIFOEnabled();
//void mpu6050_setXGyroFIFOEnabled(bool enabled);
//bool mpu6050_getYGyroFIFOEnabled();
//void mpu6050_setYGyroFIFOEnabled(bool enabled);
//bool mpu6050_getZGyroFIFOEnabled();
//void mpu6050_setZGyroFIFOEnabled(bool enabled);
//bool mpu6050_getAccelFIFOEnabled();
//void mpu6050_setAccelFIFOEnabled(bool enabled);
//bool mpu6050_getSlave2FIFOEnabled();
//void mpu6050_setSlave2FIFOEnabled(bool enabled);
//bool mpu6050_getSlave1FIFOEnabled();
//void mpu6050_setSlave1FIFOEnabled(bool enabled);
//bool mpu6050_getSlave0FIFOEnabled();
//void mpu6050_setSlave0FIFOEnabled(bool enabled);

//// I2C_MST_CTRL register
//bool mpu6050_getMultiMasterEnabled();
//void mpu6050_setMultiMasterEnabled(bool enabled);
//bool mpu6050_getWaitForExternalSensorEnabled();
//void mpu6050_setWaitForExternalSensorEnabled(bool enabled);
//bool mpu6050_getSlave3FIFOEnabled();
//void mpu6050_setSlave3FIFOEnabled(bool enabled);
//bool mpu6050_getSlaveReadWriteTransitionEnabled();
//void mpu6050_setSlaveReadWriteTransitionEnabled(bool enabled);
//uint8_t mpu6050_getMasterClockSpeed();
//void mpu6050_setMasterClockSpeed(uint8_t speed);

//// I2C_SLV* registers (Slave 0-3)
//uint8_t mpu6050_getSlaveAddress(uint8_t num);
//void mpu6050_setSlaveAddress(uint8_t num, uint8_t address);
//uint8_t mpu6050_getSlaveRegister(uint8_t num);
//void mpu6050_setSlaveRegister(uint8_t num, uint8_t reg);
//bool mpu6050_getSlaveEnabled(uint8_t num);
//void mpu6050_setSlaveEnabled(uint8_t num, bool enabled);
//bool mpu6050_getSlaveWordByteSwap(uint8_t num);
//void mpu6050_setSlaveWordByteSwap(uint8_t num, bool enabled);
//bool mpu6050_getSlaveWriteMode(uint8_t num);
//void mpu6050_setSlaveWriteMode(uint8_t num, bool mode);
//bool mpu6050_getSlaveWordGroupOffset(uint8_t num);
//void mpu6050_setSlaveWordGroupOffset(uint8_t num, bool enabled);
//uint8_t mpu6050_getSlaveDataLength(uint8_t num);
//void mpu6050_setSlaveDataLength(uint8_t num, uint8_t length);

//// I2C_SLV* registers (Slave 4)
//uint8_t mpu6050_getSlave4Address();
//void mpu6050_setSlave4Address(uint8_t address);
//uint8_t mpu6050_getSlave4Register();
//void mpu6050_setSlave4Register(uint8_t reg);
//void mpu6050_setSlave4OutputByte(uint8_t data);
//bool mpu6050_getSlave4Enabled();
//void mpu6050_setSlave4Enabled(bool enabled);
//bool mpu6050_getSlave4InterruptEnabled();
//void mpu6050_setSlave4InterruptEnabled(bool enabled);
//bool mpu6050_getSlave4WriteMode();
//void mpu6050_setSlave4WriteMode(bool mode);
//uint8_t mpu6050_getSlave4MasterDelay();
//void mpu6050_setSlave4MasterDelay(uint8_t delay);
//uint8_t mpu6050_getSlate4InputByte();

